{
  "data": {
    "id": 2,
    "attributes": {
      "slug": "transitioning-from-graphic-design",
      "createdAt": "2022-03-17T10:25:01.961Z",
      "updatedAt": "2022-06-17T05:33:31.546Z",
      "publishedAt": "2022-03-17T10:25:03.148Z",
      "header": {
        "__component": "header.text",
        "title": "Transitioning from Graphic Design to UX Design",
        "subtitle": "Is that for you?",
        "description": "",
        "featuredImage": {
          "data": null
        }
      },
      "content": [
        {
          "id": 15,
          "__component": "content.text",
          "title": null,
          "subtitle": null,
          "description": "Here is a little background: I was a graphic designer at a single marketing agency for 10 years. People came and went but I stayed, one because I liked my colleagues but mostly because I loved what I did. It was the intensity of the ideation process and the adrenaline rush of the pitch that kept me going. The execution after not so much but it was still exciting to see your idea come to fruition. <br />&nbsp;<br />Having said that, a year and half ago I was presented with the opportunity to try out a distinctive design field — user experience or UX as it is affectionately known in the industry. After giving it some thought, I took it because it was the Design Lead in Celcom himself who recruited me, and I was surprised I passed the challenging entry process to join the company. <br />&nbsp;<br />Having said that, if ever you find yourself being given the opportunity to transition and needed some idea on what goes on behind the digital wall, here is a little sneak behind the curtain for you."
        },
        {
          "id": 16,
          "__component": "content.text",
          "title": "Journey to be in UX UI role",
          "subtitle": "",
          "description": "Every one of us likes to see beautiful things, pleasant designs, and fascinating movies. Design in these things is a crucial element to me, as I tend to imagine how things can be even greater by injecting more thought to it. That is how I started my journey as a designer. <br />&nbsp;<br />Back in 2020, upon being reached out to, I decided to begin my pivot from a graphic designer to UX designer. I spent months preparing for the job as a UX designer by picking up Adobe XD, learning new skills to design mobile app user flows, and creating a portfolio to demonstrate not just my design skills but design thinking, customer experience (CX) and end-to-end journey experiences. This is done through adapting to the terms of the world of UX, repurposing my knowledge as a graphic designer to a UX designer by recognising problems or opportunities, bug fixes and iterating until the best solution (for the moment) is found."
        },
        {
          "id": 17,
          "__component": "content.text",
          "title": "Difficulties when first joined as a UX designer",
          "subtitle": "Creativity in Advertising vs UX",
          "description": "The primary goal of a UX designer is to shape the usability of a product over aesthetic design when designing an experience for the end users. We construct wireframe design and prototypes to convey the message that we want to deliver to stakeholders. It’s a visual storytelling over siloed designs. <br />&nbsp;<br />As for graphic design, it is commonly associated with branding, marketing, and advertising of certain products or services. The idea is to create overall aesthetic of an artwork and focus on the visual elements. <br />&nbsp;<br />It is usually a lengthier process for UX design, where we need to gather requirements, go through design thinking process, user testing, stakeholder management, and so on. Logical thinking plays a key role here; however, even though everything will be controlled, creativity still matters as I will explain. <br />&nbsp;<br />Keeping in line with the consistency of a predetermined component design guideline is crucial for UX. Usually called design system, the guideline is generally overseen by a design system team that governs the consistent experience across all touch points of an organisation. That is how I can repurpose the creativity I harnessed as a graphic designer, by applying my previous creative experiences to create expressive icons and <Lottie animation icons>. Nonetheless, ultimately the imagination in UX must still be rooted in practicality. There is also no such thing as a Final Artwork for UX Designers — there is always room to grow and evolve a product."
        },
        {
          "id": 18,
          "__component": "content.text",
          "title": null,
          "subtitle": "Understanding what UX in any industry is about",
          "description": "After joining as a UIUX designer in Celcom, it took me some time to adapt to the unfamiliar environment and I quickly realised that I was clearly a newbie in the UIUX design field. Ways to overcome the lack of skills and knowledge is to learn with an open mind and to ask a lot of questions to gain a greater understanding of what is expected in the role. <br />&nbsp;<br />Start by always being curious and take part in webinars to get a deeper understanding of UX and to develop your skills. A good place to get up to date with UIUX trends would be via designers from YouTube, dribbles, and Behance to name a few."
        },
        {
          "id": 25,
          "__component": "content.image",
          "caption": null,
          "image": {
            "data": {
              "id": 80,
              "attributes": {
                "name": "Understanding what UX in any industry is about",
                "alt": "Understanding what UX in any industry is about",
                "caption": "Understanding what UX in any industry is about",
                "width": 2084,
                "height": 2084,
                "ext": ".jpg",
                "mime": "image/jpeg",
                "size": 248.2,
                "url": "/uploads/articles/graphicdesign-uxdesign/1.jpg",
                "previewUrl": null,
                "provider": "local",
                "provider_metadata": null,
                "createdAt": "2022-03-21T03:00:28.803Z",
                "updatedAt": "2022-03-21T03:00:28.803Z"
              }
            }
          }
        },
        {
          "id": 39,
          "__component": "content.text",
          "title": null,
          "subtitle": null,
          "description": "For example, once you are skilled, you can get creative with the assigned requirements of a journey by figuring out how to combine multiple steps or to craft the shortest user journey. Once, when I found myself in such a situation, it required multiple review sessions with internal teams and user testing sessions to be sure the journey I proposed is successful based on the requirements. Upon presentation of our findings to the stakeholders, we were able to convince them with the proven stats and data that 2 different journeys on the Celcom Life could be streamlined into a single journey without duplication of work by the developers and other team members. <br />&nbsp;<br />By always practising the design thinking processes, upcoming projects will run smoothly with everyone having a better understanding of the UIUX designer’s processes as well as the organization’s workflow and what to be expect in the future."
        },
        {
          "id": 40,
          "__component": "content.text",
          "title": null,
          "subtitle": "Cultural differences",
          "description": "Are you still wondering what people in UX actually do? Coding? Website? Apps? To be honest, people tend to be confused of what UX actually is. <br />&nbsp;<br />Being part of the BAU (Business As Usual) team in the Digital department as well the GTM (Go to Market) team, the pace of working is fast while still adhering to the processes, which means that everything will be done in due time. All tasks follow an agreed methodology, like user research, wireframing, prototyping and reviewing with various stakeholders (channel owners, senior designers, writers). Final version or iteration of a journey would be close to the expected outcome, with the data and test results serving as backups."
        },
        {
          "id": 26,
          "__component": "content.image",
          "caption": null,
          "image": {
            "data": {
              "id": 81,
              "attributes": {
                "name": "Cultural differences",
                "alt": "Cultural differences",
                "caption": "Cultural differences",
                "width": 2085,
                "height": 2084,
                "ext": ".jpg",
                "mime": "image/jpeg",
                "size": 229.48,
                "url": "/uploads/articles/graphicdesign-uxdesign/2.jpg",
                "previewUrl": null,
                "provider": "local",
                "provider_metadata": null,
                "createdAt": "2022-03-21T03:02:14.546Z",
                "updatedAt": "2022-03-21T03:02:14.546Z"
              }
            }
          }
        },
        {
          "id": 41,
          "__component": "content.text",
          "title": null,
          "subtitle": null,
          "description": "This is contrary to the agency life, where I am familiar with having our ideas being shot down or axed way before it ever reaches to the client. We often have such limited time that we don't get to create user personas, user journey mapping and validating designs through testing especially for last minute clients briefings expecting a quick turnaround time. <br />&nbsp;<br />However, graphic designers who had to go through that ‘hell’ (a hard time) come out on the other side with a more competitive edge and hardened against rejections."
        },
        {
          "id": 42,
          "__component": "content.text",
          "title": "Silver Linings",
          "subtitle": "Design skills are transferable",
          "description": "It is important to know that between the roles of a UXD and GD, there are still several concept similarities. Design is for everything that caters to the mass market, and both require communication skills, storyboarding, and of course, design skills. Both types of designers should also have a strong knowledge of graphic-based computer software and systems. <br />&nbsp;<br />Most important of all is stay open minded and ready to constantly absorb new information and latest design trends. Also, no matter how good the UX of a product is, advertising is the wings that will take your product to new heights."
        },
        {
          "id": 43,
          "__component": "content.text",
          "title": null,
          "subtitle": "Thoughts",
          "description": "To round it up, I am fortunate that I have learnt the skillset as a graphic designer to build a strong foundation to be able to be where I am today. <br />&nbsp;<br />To be needed in the ‘market’ solely depends on your own capabilities, No matter where we are today, the only thing that doesn’t change is the ‘present’ and we have to always make that count. <br />&nbsp;<br />Never stop exploring."
        }
      ],
      "author": {
        "data": {
          "id": 6,
          "attributes": {
            "firstName": "Quenic",
            "lastName": "Lo",
            "role": "UI/UX Design"
          }
        }
      },
      "category": {
        "data": {
          "id": 1,
          "attributes": {
            "name": "UX/UI",
            "createdAt": "2022-03-15T02:45:16.994Z",
            "updatedAt": "2022-03-15T02:45:18.919Z",
            "publishedAt": "2022-03-15T02:45:18.916Z"
          }
        }
      }
    }
  },
  "meta": {}
}
